{
  "anecdotes": [
  "Кто-то удерживает партнера браком, кто-то ребенком, кто-то угрозами.\nМой мужик втерся в доверие, поставил на мой комп линукс, и я теперь от него никуда не денусь.\nПотому что если что-то в этом линуксе поломается, я без мужика вообще хз че делать.",
  "У меня коллега поднял веб-сервер на пылесосе Xiaomi (там какой-то линукс, чуть ли не дебиан стоял) и очень удивлялся, почему иногда сайт с него быстро открывался, а иногда сильно дольше. Оказалось, что когда пылесос уезжал в дальние углы квартиры там вайфай плохо ловил.",
  "Время от времени отваливался wifi на линукс-рутере. Написал watchdog скрипт, который передергивал wifi если пропадали пинги. Убил часа полтора. Как запустил - так сразу всё перестало отваливаться. Может, проще было руками передергивать каждый раз?",
  "Петя установил себе линукс и всю ночь ебался с настройками. Вася установил виндоуз Насте и всю ночь ебался с Настей.",
  "Линукс, это, сука, свобода. Вот ты решил выстрелить себе в ногу. Какая-нибудь гребаная винда не даст тебе это сделать. А с линуксом - пожалуйста! Берешь ствол, прицеливаешься, стреляешь. А, не нихера! Спусковой крючок не срабатывает! sudo стреляешь - теперь спусковой крючок срабатывает, но патрон, сука не совместим с твоим оружием. Окей, мля, подключаешь левый репозиторий с патронами, качаешь нужные патроны, sudo стреляешь - выстрел идет, но, сука не туда, потому что у этих патронов другие параметры. Окей, мля, man патроны, гугл патроны, экспертэксченджпрастихоспаде патроны - нашел! sudo стреляешь кучапараметров - идет выстрел, но ты забыл примонтировать ногу. Забиваешь, отгрызаешь себе ногу и с матом идешь домой.\n\n",
  "2030 год, штат Техас. В дверь звонит полицейский: - Это вы играете в пиратский 'Контр страйк'? - Что вы, у меня линукс, и нет звуковой карты. - А соседи настучали, что слышали у вас звуки из этой игры. - А, это я стрелял с балкона наугад из настоящего пулемёта и метал настоящие гранаты. - А авторское право вы, стало быть, не нарушали? - Да я что, отморозок, подонок, бандит, что ли! - Тогда извините. Я ошибся. Уезжаю.\n\n",
  "Обсуждение на опеннет релиза penSUSE\nАноним: Пацаны у этого дистра остался еще истинно германский дух?\nлолшто: Дух немецкого кинематографа присущ всем дистрибутивам линукс",
  "xxx: ахаха, бить в бубен? Зачем?)))\nyyy: Это старая шутка программистов про Линукс. Типа там сложно всё. Мы как-то с ZZZ ставили ему Линукс и у нас ни в какую не выставлялось разрешение экрана. Ну мы решили поржать, включили на телефоне с вк песню чукотских шаманов - и разрешение экрана поменялось. Вот тогда был шок...",
  "xxx: У меня на дуалбут-системе после обновы до [windows 10] 2004 почему-то снесло загрузочную запись винды, оставив только линукс. Винда видит конкуренцию и роскомнадзорит от отчаяния?\nyyy: Раньше бы она затёрла загрузчик Linux. Винда уже не та…",
  "Сижу спокойно выбираю какой дистрибутив линукс поставить на ноутбук, жена уехала заниматься шопингом. В ватсап от неё приходит фото: мужские шорты для плавания с пингвинчиками!. Совпадение, карма?\n\n",
  "PashaNedved: Главная причина, почему линукс — он свободный.\nfreecoder_xx: А как же \"работа напильником\"? Вас от нее он не освобождает )\nApeCoder: Так это он свободный, а не вы",
  "xxx: Единственный минус — нет линукс-клиента.\nууу: Он есть, я даже пользовался им некоторое время.\nххх: Я тоже им пользовался некоторое время, поэтому и написал, что его нет.",
  "ххх:\nвчера пять часов ставил на рабочую машину линукс с кастомного дистрибутива фирмы.\nи сегодня уже третий час занимаюсь тем же\nххх:\nуже вторая смена поддержки разводит руками и не может объяснить, почему оно не ставится\nххх:\nпо уровню удовольствия, лучше б я на гей-бдсм вечеринку попал\nххх:\nтам, хотя бы теоретически, был бы шанс побыть активом",
  "ht: сделал скриншот - перестало играть одно ухо\nht: линукс, хуле",
  "Дистрибутивы Линукс чем то похожи на чиновников:\n\nИх очень много. Для любой задачи есть свой. Некоторые основаны на других чиновниках. Да и много чего ещё.\n\nЖаль у чиновников нельзя исходники править",
  "(У xxx и yyy есть настолько старый ноут, что даже вин xp уже не тянет)\n\nxxx: мы не хотим сегодня вечером поставить на наш старый ноут линукс?\nyyy: если честно, я предпочитаю более традиционные виды секса...",
  "Почему американцы будут бомбить Антарктиду:\n1) Пингвины не заявили о поддержке США,- значит, поддерживают международный терроризм.\n2) Кроме пингвинов в Антарктиде никто не живёт,- налицо этнические чистки.\n3) Пингвины не умеют говорить,- значит, не соблюдается свобода слова.\n4) Пингвин — символ антиамериканской операционки «Линукс».",
  "Линукс - это такой большой прекрасный дворец, в котором будет место для всех, когда его закончат, но его не закончат никогда, потому что отцы-основатели постоянно переделывают фундамент.\n\n",
  "XXX: Гентушники не настраивают линукс, они его только собирают)\nYYY: Ну да, если хочешь подключиться к другому вайфаю - просто пересобери ядро.",
  "Зацепилась краем глаза за контекстную рекламу, читаю: \"Линукс для детей\". И ребенок такой довольный-довольный и очень счастливый. Долго думала о том, до чего дошел прогресс: уже детей за юниксоид сажают. Ан нет, просто неправильно прочитала название лекарства :(\n\n",
  "xxx: Включил такой сегодня баттлнет\nxxx: А он такой \"ваша система скоро перестанет поддерживаться\"\nxxx: Аж охерел, когда это близзы поддерживали линукс?",
  "xxx: почему я не удивлен,что в комментах паблика про магию, обсуждают линукс ли андроид?\n\n",
  "xxx: На одном моем ноутбуке обновление винды десятки затерло убунту линукс, параллельно существовавшем на нем же. А на другом более слабом стареньком маленьком ноуте убунта выдворила винду, так же параллельно установленную. Одним словом, пока идут священные войны нашего времени, важным данным лучше затаиваться на облаках.",
  "Однажды на одном вопрос-ответном сервисе какой-то школьник выложил вопрос: \"Вот все пиарят Линукс!!! Но ведь он же говно?!!!\" Ему ответили лишь одним словом, после которого он вышел из себя, начал ругаться матом, обзываться и вскоре был забанен. Звучал этот ответ так: \"Почему?\"",
  "Рутрекер. Раздача одной кустарной сборки Linux Mint.\n<GREK8909> Несколько месяцев назад установил знакомой вашу сборку (в гостях был и случайно с флешкой с вашей сборкой), так она до сих пор радуется что у нее система не тормозит и про вирусы забыла, я для нее прям программист. Правда я с тех пор завязал устанавливать линукс пьяным мало знакомым девушкам, линукс хоть и защищен от вирусов, но я нет а \"антивирусную\" защиту не взял...",
  "xxx: какой антивирус поставить людям, которые лазают даже там, где черт ногу сломит и да, ставят всякое?\nyyy: линукс ставьте",
  "услышал в споре каких-то чуваков:\nxxx: раз линукс такой классный, почему к нему кряков нет нигде?",
  "xxx: Идея установить линукс на ноут пришла одновременно с конъюнктивитом, это что-то значит\n\n",
  "Он: не хочешь ставить винду всю ночь? у меня осталось 200 компов((\nОна: А-ха-ха... черт. Это самое фееричное предложение за последний год, наверно, и... нет! Я хочу ставить линукс. Всю ночь ))",
  "На одном из форумов по linux\nxxx: sysV - устарел и к нему нужна куча самописных костылей, которые в systemd идут из коробки.\nyyy: Костыли \"искаропки\". Узнаю любимый линукс.",
  "xxx: У хорошего линуксиста дома всегда есть что-то, на что можно поставить линукс\n\n",
  "на сайлоге:\n\ne-note: Она тут в очередной раз переставляет линукс, так что какие-то письма могли потеряться.\n\nАл: Слушай, а ты не много работаешь? Может быть надо чаще бывать дома?\n\ne-note: Знаешь, если жена интеллектуально отличается от табуретки, то как бы часто и подолгу ты не бывал дома, у нее рано или поздно заводятся хобби. И слава аллаху, если это линукс: максимум, чем я рискую - что у нее вырастет борода и свитер с оленями",
  "Jktu: Но в главном я с вами согласен: если разработчики обещали линукс-версию, то должны сделать. Жаль, что они не японцы и не следуют кодексу бусидо, там ведь строго: врать или не выполнять обещание - недопустимо, не выполнил приказа босса - отрезаешь себе мизинец, в следующий раз - безымянный и так далее, а если опозорил себя или организацию - делаешь сэппуку. Бусидо-программистов в отечественном игропроме явно не хватает)\nPHILIN: Они просто больше одного проекта не живут",
  "xxx: друг хвастается, что учит перл, идет на инглиш и перешел на линукс\nyyy: повзрослел :-D\nyyy: а то раньше было - учит тактики, идет в рейд и перешел за альянс",
  "xxx:\nНедавно перешла на Линукс. Так как долго не могла настроить раздачу вай-фая со своего ноута, попросила однокурсника зайти ко мне вечером посмотреть. Он с довольной коварной улыбкой пообещал всенепременно зайти вечером. Но я решила перед его приходом попробовать еще раз самой, и, о чудо, все заработало. Пришлось долго объяснять Пашке, что я на самом деле звала его именно настроить вай-фай :))",
  "xxx: Вы думаете, Линукс бесплатный? Нет, он просто принимает оплату только натурой.\n\n",
  "на работе с прогером\n\nя: у тебя семерка? а линукс виртуальной машиной?\nон: нет, тут семерка на компе, а линукс дома на ноуте\nя: то есть ты ходишь на работу поработать на домашнем компе по удаленке?\nон: ну да )))\n\n",
  "Пропал у меня инет. Звоню, так сказать, в группу поддержки, мол,\nдяденьки-интернетчики, кобздец и абдуценс - связи нет!\n- Очень хорошо, - ласково согласился приятный мужской голос и что-то\nнечленораздельно-матерное простонал в сторону. - Очень хорошо, - четко и\nраздельно (так обычно говорят с умственно-отсталыми) повторил он, взяв\nсебя в руки, - Проверьте, пожалуйста, кабель подключен? Точно подключен?\nТогда проверим настройки. Какой виндоуз у вас стоит?\nЯ:\n- ... э-э-э...\nТихий стон в сторону и совсем уж ласково и внятно:\n- Может быть 98? Или ХР? Припомните, пожалуйста!\nЯ:\n- ... э-э-э... вообще-то у меня линукс.\nТишина. Дую в трубку, стучу пальцем, повторяю \"алло! алло!\"\nЧерез две минуты бодрой скороговоркой:\n- Отлично, девушка, мы поищем специалиста и на неделе обязательно с вами\nчто-нибудь сделаем!\n??????",
  "Объявлено об объединении Микрософт и Линукс. Эмблемой новой системы\nвыбран пингвин, выпадающий в окно.\nUkiwa the cheetah"]
}